---
kind: method
id: M:Autodesk.Revit.DB.Face.GetBoundingBox
source: html/b3e5f146-e042-ffcb-b0cc-c679a08d6129.htm
---
# Autodesk.Revit.DB.Face.GetBoundingBox Method

Returns the UV bounding box of the face.

## Syntax (C#)
```csharp
public BoundingBoxUV GetBoundingBox()
```

## Returns
A BoundingBoxUV with the extents of the parameterization of the face.